/****************************************************************************
 * vendor/artinchip/boards/d13x-hengshan-pi/src/artinchip_boot.c
 *
 * D13x Hengshan Pi 板级启动初始化
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/board.h>
#include <arch/board/board.h>

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: board_early_initialize
 *
 * Description:
 *   执行板级早期硬件初始化（禁止阻塞）
 *
 ****************************************************************************/

#ifdef CONFIG_BOARD_EARLY_INITIALIZE
void board_early_initialize(void)
{
  /* 早期硬件初始化 */
}
#endif

/****************************************************************************
 * Name: board_late_initialize
 *
 * Description:
 *   执行板级主要驱动初始化（允许阻塞）
 *
 ****************************************************************************/

#ifdef CONFIG_BOARD_LATE_INITIALIZE
void board_late_initialize(void)
{
  /* 主要驱动初始化 */
}
#endif

/****************************************************************************
 * Name: board_app_initialize
 *
 * Description:
 *   由 nsh 任务调用，初始化应用层
 *
 ****************************************************************************/

int board_app_initialize(uintptr_t arg)
{
  /* 应用层初始化 */

  return OK;
}
